Revit 2025 API
GBXMLExportOptions Constructor
Overload List
Name | Description
GBXMLExportOptions() |  Constructs a new instance of the options used to export a model in gbXML (green-building) format.
GBXMLExportOptions(IList<ElementId>, IList<ElementId>) |  Constructs a new instance of the options used to export a mass model to gbXML.
Top
See Also
Reference
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace